liambontkes/Software/src/firmware/boards/robot_stm32h7/io/gpio_pin.c
#include "firmware/boards/robot_stm32h7/io/gpio_pin.h"

#include <stdlib.h>

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wsign-conversion"
#include "firmware/boards/robot_stm32h7/stm32h7xx_hal_conf.h"
#pragma GCC diagnostic pop

typedef struct GpioPin
{
    GPIO_TypeDef* gpio_handler;
    uint16_t gpio_pin_index;
    GpioPinActiveState active_state;
} GpioPin_t;

/**
 * Set raw HAL state for the given GPIO pin
 * @param gpio_pin The pin to set the state for
 * @param pin_state The state to set the pin to
 */
void io_gpio_pin_setHALPinState(GpioPin_t* gpio_pin, GPIO_PinState pin_state);

/**
 * Get the raw HAL state for the given GPIO pin
 * @param gpio_pin The pin to get the state for
 * @return true if "active", false if not "active"
 */
GPIO_PinState io_gpio_pin_getHALPinState(GpioPin_t* gpio_pin);

GpioPin_t* io_gpio_pin_create(GPIO_TypeDef* gpio_handler, uint16_t gpio_pin_index,
                              GpioPinActiveState active_state)
{
    GpioPin_t* gpio_pin = (GpioPin_t*)malloc(sizeof(GpioPin_t));

    gpio_pin->gpio_handler   = gpio_handler;
    gpio_pin->gpio_pin_index = gpio_pin_index;
    gpio_pin->active_state   = active_state;

    io_gpio_pin_setInactive(gpio_pin);

    return gpio_pin;
}

void io_gpio_pin_destroy(GpioPin_t* gpio_pin)
{
    free(gpio_pin);
}

void io_gpio_pin_setActive(GpioPin_t* gpio_pin)
{
    switch (gpio_pin->active_state)
    {
        case ACTIVE_HIGH:
            io_gpio_pin_setHALPinState(gpio_pin, GPIO_PIN_SET);
            return;
        case ACTIVE_LOW:
            io_gpio_pin_setHALPinState(gpio_pin, GPIO_PIN_RESET);
            return;
    }
}

void io_gpio_pin_setInactive(GpioPin_t* gpio_pin)
{
    switch (gpio_pin->active_state)
    {
        case ACTIVE_HIGH:
            io_gpio_pin_setHALPinState(gpio_pin, GPIO_PIN_RESET);
            return;
        case ACTIVE_LOW:
            io_gpio_pin_setHALPinState(gpio_pin, GPIO_PIN_SET);
            return;
    }
}

bool io_gpio_pin_getState(GpioPin_t* gpio_pin)
{
    switch (io_gpio_pin_getHALPinState(gpio_pin))
    {
        case GPIO_PIN_SET:
            return (gpio_pin->active_state == ACTIVE_HIGH);
        case GPIO_PIN_RESET:
            return (gpio_pin->active_state == ACTIVE_LOW);
        default:  // would prefer to use GPIO_PIN_RESET but get build error
            break;
    }
    return false;
}

void io_gpio_pin_setHALPinState(GpioPin_t* gpio_pin, GPIO_PinState pin_state)
{
    HAL_GPIO_WritePin(gpio_pin->gpio_handler, gpio_pin->gpio_pin_index, pin_state);
}

GPIO_PinState io_gpio_pin_getHALPinState(GpioPin_t* gpio_pin)
{
    return HAL_GPIO_ReadPin(gpio_pin->gpio_handler, gpio_pin->gpio_pin_index);
}
